[
    {
        "question50": "Физический уровень модели OSI. Виды передаваемых сигналов",
        "answers": [
            "1. Физический уровень отвечает за передачу необработанных битов по физической среде. Он определяет параметры электрических, оптических или радиосигналов: уровни напряжения, частоты, типы модуляции, характеристики кабелей и разъемов. Сигналы могут быть аналоговыми и цифровыми; цифровые представляют собой дискретные состояния, а аналоговые — непрерывные изменения параметров. Также физический уровень задаёт скорость передачи, дальность и форматы кодирования (NRZ, Manchester, 4B/5B и др.).",
            "2. Физический уровень выполняет маршрутизацию пакетов и отвечает за работу коммутаторов. Передаваемые сигналы на нём исключительно цифровые и имеют строго фиксированную частоту 50 Гц, как в бытовой электрической сети.",
            "3. Физический уровень OSI служит для преобразования данных в готовые сетевые пакеты и их последующего шифрования. Передаются только аналоговые сигналы, так как цифровые считаются слишком шумными."
        ],
        "correct_answer": "1. Физический уровень отвечает за передачу необработанных битов по физической среде. Он определяет параметры электрических, оптических или радиосигналов: уровни напряжения, частоты, типы модуляции, характеристики кабелей и разъемов. Сигналы могут быть аналоговыми и цифровыми; цифровые представляют собой дискретные состояния, а аналоговые — непрерывные изменения параметров. Также физический уровень задаёт скорость передачи, дальность и форматы кодирования (NRZ, Manchester, 4B/5B и др.)."
    },
    {
        "question51": "Канальный уровень и его подуровни. Преобразование кадров данных",
        "answers": [
            "1. Канальный уровень состоит из двух подуровней: LLC (Logical Link Control) и MAC (Media Access Control). LLC отвечает за управление логическим соединением и взаимодействие с сетевым уровнем, а MAC — за доступ к среде передачи, формирование и разбор кадров. Кадры данных включают заголовки, служебную информацию, MAC-адреса и контрольные суммы. Канальный уровень обеспечивает обнаружение ошибок, управление доступом к среде и сегментацию данных в кадры.",
            "2. Канальный уровень имеет только один подуровень MAC, который отвечает за маршрутизацию IP-пакетов по всей сети. Преобразование кадров выполняется только на сетевом уровне, а канальный уровень лишь пересылает байты без анализа.",
            "3. Канальный уровень применяется только в беспроводных сетях. Подуровни LLC и MAC используются для шифрования данных, а кадры представляют собой зашифрованные фрагменты, которые проходят через транспортный уровень."
        ],
        "correct_answer": "1. Канальный уровень состоит из двух подуровней: LLC (Logical Link Control) и MAC (Media Access Control). LLC отвечает за управление логическим соединением и взаимодействие с сетевым уровнем, а MAC — за доступ к среде передачи, формирование и разбор кадров. Кадры данных включают заголовки, служебную информацию, MAC-адреса и контрольные суммы. Канальный уровень обеспечивает обнаружение ошибок, управление доступом к среде и сегментацию данных в кадры."
    },
    {
        "question52": "Сетевой уровень модели OSI. Четыре процесса сетевого уровня",
        "answers": [
            "1. Сетевой уровень отвечает за маршрутизацию, логическую адресацию и определение пути передачи. Основные процессы включают: маршрутизацию пакетов, фрагментацию и сборку пакетов, управление перегрузками и логическую адресацию. Этот уровень обеспечивает доставку данных между различными сетями посредством протоколов, таких как IP.",
            "2. Сетевой уровень выполняет только функцию преобразования кадров в сигналы. Четыре его процесса: шифрование, управление паролями, авторизация и аудиокодирование.",
            "3. Основной задачей сетевого уровня является передача данных внутри одного коммутатора. Четыре процесса — это настройка Wi-Fi, работа DHCP, включение маршрутизатора и проверка скорости интернета."
        ],
        "correct_answer": "1. Сетевой уровень отвечает за маршрутизацию, логическую адресацию и определение пути передачи. Основные процессы включают: маршрутизацию пакетов, фрагментацию и сборку пакетов, управление перегрузками и логическую адресацию. Этот уровень обеспечивает доставку данных между различными сетями посредством протоколов, таких как IP."
    },
    {
        "question53": "Транспортный уровень модели OSI и его функции",
        "answers": [
            "1. Транспортный уровень обеспечивает надёжную или ненадёжную передачу данных между конечными устройствами. Основные функции: установление, сопровождение и завершение соединения; сегментирование данных; управление потоком; контроль ошибок; повторная передача потерянных сегментов (в TCP). Также транспортный уровень поддерживает мультиплексирование соединений с помощью номеров портов.",
            "2. Транспортный уровень занимается исключительно преобразованием физических сигналов в цифровые данные. Он не использует порты и не может устанавливать соединения.",
            "3. Транспортный уровень используется только в беспроводных сетях и отвечает за усиление радиосигнала. Управление потоком и контроль ошибок выполняются на физическом уровне."
        ],
        "correct_answer": "1. Транспортный уровень обеспечивает надёжную или ненадёжную передачу данных между конечными устройствами. Основные функции: установление, сопровождение и завершение соединения; сегментирование данных; управление потоком; контроль ошибок; повторная передача потерянных сегментов (в TCP). Также транспортный уровень поддерживает мультиплексирование соединений с помощью номеров портов."
    },
    {
        "question54": "Уровень приложений модели OSI и его функции",
        "answers": [
            "1. Прикладной уровень обеспечивает взаимодействие пользовательских приложений с сетью. Он включает множество протоколов: HTTP, FTP, SMTP, DNS, Telnet. Основные функции: предоставление сервисов для работы приложений, интерпретация запросов, поддержка удалённого доступа, обмен файлами, управление почтой и именами ресурсов. Он работает с данными в форме наиболее близкой к пользователю.",
            "2. Прикладной уровень отвечает за физическую передачу сигналов и работу кабельных стандартов. В его функции входит управление MAC-адресами и маршрутизация пакетов.",
            "3. Уровень приложений работает только внутри браузеров и обеспечивает отображение веб-страниц. Другие программы к нему не имеют отношения."
        ],
        "correct_answer": "1. Прикладной уровень обеспечивает взаимодействие пользовательских приложений с сетью. Он включает множество протоколов: HTTP, FTP, SMTP, DNS, Telnet. Основные функции: предоставление сервисов для работы приложений, интерпретация запросов, поддержка удалённого доступа, обмен файлами, управление почтой и именами ресурсов. Он работает с данными в форме наиболее близкой к пользователю."
    },
    {
        "question55": "Инкапсуляции и деинкапсуляция, сегментирование, мультиплексирование в сетях",
        "answers": [
            "1. Инкапсуляция — процесс добавления заголовков и служебной информации на каждом уровне модели OSI. Деинкапсуляция — обратный процесс удаления заголовков на принимающей стороне. Сегментирование — разделение данных на фрагменты для передачи. Мультиплексирование — одновременная передача нескольких потоков данных по одному каналу с использованием портов или временного распределения.",
            "2. Инкапсуляция выполняется только маршрутизаторами при подключении к Wi-Fi. Мультиплексирование означает одновременное подключение нескольких мониторов к компьютеру.",
            "3. Сегментирование касается только жёстких дисков, а инкапсуляция — это упаковка данных в архивы ZIP перед отправкой."
        ],
        "correct_answer": "1. Инкапсуляция — процесс добавления заголовков и служебной информации на каждом уровне модели OSI. Деинкапсуляция — обратный процесс удаления заголовков на принимающей стороне. Сегментирование — разделение данных на фрагменты для передачи. Мультиплексирование — одновременная передача нескольких потоков данных по одному каналу с использованием портов или временного распределения."
    },
    {
        "question56": "Настройка сетевой платы ПК",
        "answers": [
            "1. Настройка сетевой платы включает выбор режима работы (автоопределение скорости или фиксированная), настройку дуплекса, управление энергосбережением, выбор MAC-адреса (при необходимости), настройку драйвера, MTU, параметров VLAN, приоритетов QoS. Также возможна конфигурация IPv4/IPv6, DNS, шлюза и параметров Wake-on-LAN.",
            "2. Настройка сетевой карты заключается только в установке видеодрайвера и выборе разрешения экрана. Других параметров не существует.",
            "3. Сетевая карта не требует настроек, так как она автоматически использует настройки процессора и видеокарты. Изменить её параметры невозможно."
        ],
        "correct_answer": "1. Настройка сетевой платы включает выбор режима работы (автоопределение скорости или фиксированная), настройку дуплекса, управление энергосбережением, выбор MAC-адреса (при необходимости), настройку драйвера, MTU, параметров VLAN, приоритетов QoS. Также возможна конфигурация IPv4/IPv6, DNS, шлюза и параметров Wake-on-LAN."
    },
    {
        "question57": "Виртуальные частные сети",
        "answers": [
            "1. VPN — это технология создания защищённого канала поверх публичной сети. Использует туннелирование, шифрование и аутентификацию для защиты данных. Типы VPN: PPTP, L2TP/IPsec, OpenVPN, WireGuard. Применяется для удалённого доступа, защиты трафика, обхода ограничений, объединения офисов. Обеспечивает конфиденциальность, целостность и защиту данных.",
            "2. VPN — это отдельная физическая сеть, построенная исключительно на оптоволокне. Она не использует шифрование, так как полностью изолирована от интернета.",
            "3. VPN — это функция браузера, которая ускоряет загрузку страниц за счёт кеширования данных на локальном компьютере."
        ],
        "correct_answer": "1. VPN — это технология создания защищённого канала поверх публичной сети. Использует туннелирование, шифрование и аутентификацию для защиты данных. Типы VPN: PPTP, L2TP/IPsec, OpenVPN, WireGuard. Применяется для удалённого доступа, защиты трафика, обхода ограничений, объединения офисов. Обеспечивает конфиденциальность, целостность и защиту данных."
    },
    {
        "question58": "Режимы доступа к ресурсам локальной сети, внесение изменений",
        "answers": [
            "1. В локальных сетях используются режимы: общий доступ (public share), доступ по учетным записям и доступ по группам безопасности. Настройки включают изменение разрешений (чтение, запись, изменение, полный доступ), управление списками ACL, создание общих папок, выбор уровня видимости, настройку прав доступа к принтерам и сетевым каталогам. Изменения вносятся через оснастки, серверные роли или параметры сетевых служб.",
            "2. В сетях доступ к ресурсам всегда открыт, и ограничить его невозможно. Все пользователи автоматически получают полный доступ ко всем каталогам.",
            "3. Режимы доступа определяются видеокартой. Чтобы изменить доступ, нужно изменить разрешение монитора, после чего автоматически обновятся и сетевые права."
        ],
        "correct_answer": "1. В локальных сетях используются режимы: общий доступ (public share), доступ по учетным записям и доступ по группам безопасности. Настройки включают изменение разрешений (чтение, запись, изменение, полный доступ), управление списками ACL, создание общих папок, выбор уровня видимости, настройку прав доступа к принтерам и сетевым каталогам. Изменения вносятся через оснастки, серверные роли или параметры сетевых служб."
    },
    {
        "question59": "Беспроводной доступ к сети. Стандарты и характеристики",
        "answers": [
            "1. Беспроводной доступ осуществляется на основе стандартов IEEE 802.11: a/b/g/n/ac/ax. Он использует диапазоны 2.4 и 5 ГГц, обеспечивает различные скорости, модуляции, ширину каналов. Характеристики включают дальность, чувствительность, помехоустойчивость, пропускную способность, типы безопасности (WPA2, WPA3). Беспроводные сети обеспечивают мобильность, но могут иметь повышенную задержку и подверженность интерференции.",
            "2. Беспроводной доступ всегда работает только в диапазоне 1 ГГц и имеет фиксированную скорость 100 Мбит/с. Безопасность не используется, так как сигнал считается защищённым по умолчанию.",
            "3. Стандарты беспроводной связи относятся только к мобильным телефонам, а Wi-Fi является проводной технологией, где радиосигнал служит лишь резервным каналом."
        ],
        "correct_answer": "1. Беспроводной доступ осуществляется на основе стандартов IEEE 802.11: a/b/g/n/ac/ax. Он использует диапазоны 2.4 и 5 ГГц, обеспечивает различные скорости, модуляции, ширину каналов. Характеристики включают дальность, чувствительность, помехоустойчивость, пропускную способность, типы безопасности (WPA2, WPA3). Беспроводные сети обеспечивают мобильность, но могут иметь повышенную задержку и подверженность интерференции."
    },
    {
        "question60": "Широкополосные технологии и их характеристики",
        "answers": [
            "1. Широкополосные технологии включают xDSL, DOCSIS (кабельный интернет), оптоволоконные FTTH/FTTB решения, LTE/5G. Они обеспечивают высокую пропускную способность, многоканальную передачу, поддержку симметричных и асимметричных каналов, стабильность и высокую доступность. Отличаются диапазонами частот, типами модуляции и инфраструктурой. Применяются в домашних и корпоративных сетях.",
            "2. Широкополосные технологии — это исключительно спутниковая связь, которая работает на скорости не более 1 Мбит/с. Другие технологии относятся к узкополосным.",
            "3. Широкополосные технологии включают только ADSL, так как она самая быстрая, а современные мобильные сети 5G относятся к телефонным стандартам и не имеют отношения к передаче данных."
        ],
        "correct_answer": "1. Широкополосные технологии включают xDSL, DOCSIS (кабельный интернет), оптоволоконные FTTH/FTTB решения, LTE/5G. Они обеспечивают высокую пропускную способность, многоканальную передачу, поддержку симметричных и асимметричных каналов, стабильность и высокую доступность. Отличаются диапазонами частот, типами модуляции и инфраструктурой. Применяются в домашних и корпоративных сетях."
    }
]