[
    {
        "question1": "Периоды создания и развития вычислительной техники",
        "answers": [
            "1. В истории развития вычислительных машин и систем различают домеханический, механический, электрический и электронный периоды.",
            "2. Развитие вычислительной техники разделяют на два периода: период до появления микропроцессоров и период после внедрения графических интерфейсов. Между ними выделяют этап появления первых домашних ПК (1978–1982 гг.).",
            "3. Вычислительная техника делится на периоды: первые арифмометры, ручные расчёты и цифровые компьютеры. Переход между периодами определяется исключительно социальной потребностью, а не технологическим развитием."
        ],
        "correct_answer": "1. В истории развития вычислительных машин и систем различают домеханический, механический, электрический и электронный периоды."
    },
    {
        "question2": "Поколения ЭВМ, перспективы вычислительных машин и систем",
        "answers": [
            "1. Поколения ЭВМ делят по элементной базе: 1-е (Электровакуумные лампы, 1940–1958), 2-е (транзисторы, 1958–1965), 3-е (Интегральные схемы, 1965–1975), 4-е (БИС, персональные компьютеры, 1975–н.в.), 5-е (Самообучение, РИО, ИИ, БИО системы). Основные перспективы — квантовые вычисления, гетерогенные архитектуры, энергоэффективные многоядерные системы.",
            "2. ЭВМ делят на три поколения: первое — механические машины, второе — машины на лазерах, третье — биологические компьютеры. Основная перспектива — полное замещение цифровых микросхем органическими структурами.",
            "3. Поколения вычислительных машин основаны на размерах корпусов: большие ЭВМ прошлого и компактные современные ПК. Перспектива развития — уменьшение размеров корпусов до нательного формата."
        ],
        "correct_answer": "1. Поколения ЭВМ делят по элементной базе: 1-е (лампы, 1940–1958), 2-е (транзисторы, 1958–1965), 3-е (ИС, 1965–1975), 4-е (БИС и микропроцессоры, 1975–н.в.), 5-е (нано-технологии, квантовые и нейроморфные системы — перспективное направление). Основные перспективы — квантовые вычисления, гетерогенные архитектуры, энергоэффективные многоядерные системы."
    },
    {
        "question3": "Структура архитектуры фон Неймана, её понятия и принципы",
        "answers": [
            "1. Архитектура фон Неймана — это модель, в которой данные и инструкции хранятся в разных физических банках памяти, команды выполняются параллельно, а обработка данных основана на биологических нейронных сетях.",
            "2. Архитектура фон Неймана предполагает единое адресное пространство для данных и инструкций, последовательное выполнение команд, хранение программ и данных в общей памяти, наличие АЛУ, управляющего устройства и устройств ввода-вывода. Принципы: программное управление, однородность памяти, адресность.",
            "3. Архитектура фон Неймана — это организация, при которой память отсутствует, а инструкции генерируются динамически во время вычислений самим процессором без предварительного хранения."
        ],
        "correct_answer": "2. Архитектура фон Неймана предполагает единое адресное пространство для данных и инструкций, последовательное выполнение команд, хранение программ и данных в общей памяти, наличие АЛУ, управляющего устройства и устройств ввода-вывода. Принципы: программное управление, однородность памяти, адресность."
    },
    {
        "question4": "Вычислительный конвейер и суперскалярность",
        "answers": [
            "1. Конвейер - это способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения производительности, технология, используемая при разработке компьютеров и т. д.). Суперскалярность — это архитектура вычислительного ядра, позволяющая выполнять нескольких машинных инструкций за один такт процессора, путем увеличения числа исполнительных устройств.",
            "2. Конвейер — это система охлаждения процессора, созданная для последовательного распределения тепла. Суперскалярность — технология распределения нагрузки между несколькими кулерами.",
            "3. Конвейер выполняет только одну инструкцию, но ускоряет её за счёт параллельного доступа к памяти. Суперскалярность — выполнение инструкций строго последовательно для повышения стабильности."
        ],
        "correct_answer": "1. Конвейер - это способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения производительности, технология, используемая при разработке компьютеров и т. д.). Суперскалярность — это архитектура вычислительного ядра, позволяющая выполнять нескольких машинных инструкций за один такт процессора, путем увеличения числа исполнительных устройств."
    },
    {
        "question5": "Понятие ЦПУ его основные характеристики",
        "answers": [
            "1. ЦПУ — постоянный запоминающий элемент, отвечающий за хранение инструкций. Главная характеристика — объём встроенной памяти.",
            "2. ЦПУ — это модуль охлаждения системы, определяющий скорость вращения кулера. Его характеристики: воздушный поток, диаметр вентилятора и материал радиатора.",
            "3. ЦПУ - электронный блок либо интегральная схема, исполняющая машинные инструкции, является главной частью аппаратного обеспечения компьютера. Основные характеристики: суперскалярность, базовая (тактовая) частота, нормы литографического процесса, разъём ЦПУ, количество ядер/потоков, объём и уровни кэша, микроархитектура, контроллер памяти, энергопотребление, рабочая температура."
        ],
        "correct_answer": "3. ЦПУ - электронный блок либо интегральная схема, исполняющая машинные инструкции, является главной частью аппаратного обеспечения компьютера. Основные характеристики: суперскалярность, базовая (тактовая) частота, нормы литографического процесса, разъём ЦПУ, количество ядер/потоков, объём и уровни кэша, микроархитектура, контроллер памяти, энергопотребление, рабочая температура."
    },
    {
        "question6": "Архитектура процессоров и микроархитектура ЦПУ",
        "answers": [
            "1. Архитектура — это набор команд, определяющий, какие инструкции понимает процессор (например, x86, ARM). Микроархитектура — это способ, которым данная архитектура набора команд (АНК) реализована в процессоре.",
            "2. Архитектура процессора определяется только типом сокета, а микроархитектура — формой корпуса и количеством контактов.",
            "3. Архитектура процессора — это расположение компонентов на материнской плате, а микроархитектура — дизайн трассировок питания и сигнальных дорожек."
        ],
        "correct_answer": "1. Архитектура — это набор команд, определяющий, какие инструкции понимает процессор (например, x86, ARM). Микроархитектура — это способ, которым данная архитектура набора команд (АНК) реализована в процессоре."
    },
    {
        "question7": "Многоядерные ЦПУ, модели КЭШа",
        "answers": [
            "1. Многоядерные ЦПУ - центральные процессоры, содержащие два и более вычислительных ядра на одном процессорном кристалле или в одном корпусе. Кэш-модели: L3 (гомогенная или гетерогенная), L2 (разделяемая и индивидуальная), L1 (для каждого ядра). Архитектуры межъядерного взаимодействия — разделяемая шина, mesh, сеть с коммутатором, общая кэш-память.",
            "2. Многоядерные ЦПУ — это процессоры, которые используют одну общую кэш-память уровней L1–L3, но ядра переключаются между потоками последовательно. Модели кэша отсутствуют, так как используется единый буфер.",
            "3. Многоядерные процессоры работают только с одним кэшем, который перемещается между ядрами в зависимости от нагрузки; архитектура кэша основана на динамической миграции блоков."
        ],
        "correct_answer": "1. Многоядерные ЦПУ - центральные процессоры, содержащие два и более вычислительных ядра на одном процессорном кристалле или в одном корпусе. Кэш-модели: L3 (гомогенная или гетерогенная), L2 (разделяемая и индивидуальная), L1 (для каждого ядра). Архитектуры межъядерного взаимодействия — разделяемая шина, mesh, сеть с коммутатором, общая кэш-память."
    },
    {
        "question8": "Сопроцессор, варианты исполнения. Интерфейс QuickPath (QPI). Контроллер памяти и др. характеристики ЦПУ.",
        "answers": [
            "1. Сопроцессор — элемент системы охлаждения, размещённый рядом с процессором. QPI — интерфейс для подключения вентиляторов. Контроллер памяти отвечает за регулировку скорости вращения кулера. Встроенный контроллер памяти (цифровая схема, управляющая потоком данных к процессору от оперативной памяти), защита от перегрева, энергопоребление, кэш-иерархию(L1, L2, L3).",
            "2. Сопроцессор — специальный арифметический процессор, для выполнения арифметических операций с плавающей точкой. QPI — высокоскоростной точка-точка интерфейс Intel для связи ЦПУ с другим процессором или контроллером. Современные ЦПУ включают: встроенный контроллер памяти (цифровая схема, управляющая потоком данных к процессору от оперативной памяти), защита от перегрева, энергопоребление, кэш-иерархию(L1, L2, L3).",
            "3. Сопроцессор используется только в видеокартах. QPI — интерфейс для подключения мониторов. Контроллер памяти встроен в материнскую плату и не взаимодействует с ЦПУ."
        ],
        "correct_answer": "2. Сопроцессор — специальный арифметический процессор, для выполнения арифметических операций с плавающей точкой. QPI — высокоскоростной точка-точка интерфейс Intel для связи ЦПУ с другим процессором или контроллером. Современные ЦПУ включают: встроенный контроллер памяти (цифровая схема, управляющая потоком данных к процессору от оперативной памяти), защита от перегрева, энергопоребление, кэш-иерархию(L1, L2, L3)."
    },
    {
        "question9": "BIOS и его функции. Разновидности BIOS.",
        "answers": [
            "1. BIOS — набор микропрограмм, реализующих API, для работы с аппаратурой компьютера и подключёнными к нему устройствами, которая хранится на ROM микросхеме. Функции: настройка оборудования, проверка работоспособности оборудования, загрузка опер.системы, предоставление  API для работы с оборудованием. Разновидности: BIOS материнской платы компьютера (сервера), BIOS периферийных устройств (например, BIOS графической карты).",
            "2. BIOS — это драйвер сетевой карты, обеспечивающий подключение к Интернету. Разновидности BIOS определяются типом сетевого протокола: TCP-BIOS и UDP-BIOS.",
            "3. BIOS — это интерфейс для настройки видеокарты, позволяющий изменять параметры графики. Разновидности BIOS разделяются по компании-производителю GPU."
        ],
        "correct_answer": "1. BIOS — набор микропрограмм, реализующих API, для работы с аппаратурой компьютера и подключёнными к нему устройствами, которая хранится на ROM микросхеме. Функции: настройка оборудования, проверка работоспособности оборудования, загрузка опер.системы, предоставление  API для работы с оборудованием. Разновидности: BIOS материнской платы компьютера (сервера), BIOS периферийных устройств (например, BIOS графической карты)."
    },
    {
        "question10": "Порядок перепрошивки BIOS у современных ВМ",
        "answers": [
            "1. Чтобы перепрошить BIOS, необходимо полностью разобрать системный блок, извлечь микросхему BIOS и заменить её новой, предварительно нагрев на паяльной станции. После замены BIOS запускается автоматически.",
            "2. Алгоритм обновления: загрузка последней версии прошивки с сайта производителя; запись файла на USB; вход в UEFI; запуск утилиты обновления (Q-Flash, EZ-Flash и др.); выбор файла; подтверждение; автоматическая перезагрузка; восстановление настроек. Часто применяется резервная копия и функция DualBIOS.",
            "3. Перепрошивка BIOS выполняется через операционную систему с помощью стандартной программы «Обновление Windows», так как BIOS является частью Windows и обновляется вместе с драйверами."
        ],
        "correct_answer": "2. Алгоритм обновления: загрузка последней версии прошивки с сайта производителя; запись файла на USB; вход в UEFI; запуск утилиты обновления (Q-Flash, EZ-Flash и др.); выбор файла; подтверждение; автоматическая перезагрузка; восстановление настроек. Часто применяется резервная копия и функция DualBIOS."
    },
    {
        "question11": "Этапы загрузки компьютера, RTC и CMOS. Устранение типовых неисправностей",
        "answers": [
            "1. Загрузка ПК начинается с процедуры POST, выполняемой микропрограммой BIOS/UEFI: проверяются базовые устройства, инициализируются контроллеры, затем происходит обращение к RTC для получения текущего времени и конфигурации системы из CMOS RAM. После этого выбирается загрузочное устройство согласно Boot Priority, выполняется передача управления загрузчику ОС. Типовые неисправности связаны с разряженной батарейкой CMOS, некорректными настройками Boot Order, сбоями оборудования; устраняются через сброс BIOS, замену батарейки, проверку кабелей и модулей ОЗУ.",
            "2. Этапы загрузки ПК сводятся к тому, что ЦПУ сразу запускает операционную систему с жёсткого диска, минуя BIOS, а данные времени и конфигурации берутся напрямую из накопителя. CMOS и RTC участвуют только в управлении питанием. Типичные неисправности — это ошибки ОС, которые устраняются переустановкой Windows.",
            "3. POST осуществляется операционной системой, а BIOS лишь служит интерфейсом для передачи данных между устройствами хранения. RTC отвечает только за питание процессора, а CMOS используется исключительно для хранения драйверов устройств. Проблемы загрузки решаются обновлением видеодрайвера."
        ],
        "correct_answer": "1. агрузка ПК начинается с процедуры POST, выполняемой микропрограммой BIOS/UEFI: проверяются базовые устройства, инициализируются контроллеры, затем происходит обращение к RTC для получения текущего времени и конфигурации системы из CMOS RAM. После этого выбирается загрузочное устройство согласно Boot Priority, выполняется передача управления загрузчику ОС. Типовые неисправности связаны с разряженной батарейкой CMOS, некорректными настройками Boot Order, сбоями оборудования; устраняются через сброс BIOS, замену батарейки, проверку кабелей и модулей ОЗУ."
    },
    {
        "question12": "Понятие UEFI и его функции, основные отличия от BIOS, перспективы BIOS",
        "answers": [
            "1. UEFI — интерфейс между операционной системой и микропрограммами, управляющими низкоуровневыми функциями оборудования, его основное предназначение: корректно инициализировать оборудование при включении системы и передать управление загрузчику операционной системы. UEFI - это более современное решение,  и оно поддерживает большое количество удобных функций, полезных на современных компьютерах нежели BIOS Благодаря модульной структуре UEFI, новые функции могут быть добавлены позже и тем самым расширить существующую систему. Это делает такую систему более перспективной и простой в использовании. Использовать новые системы UEFI намного проще, у них есть полноценный графический интерфейс с указателем мыши и интуитивно понятным меню. Вы получаете возможность все очень просто настроить. Кроме того, производители материнских плат могут разрабатывать различные программные модули UEFI.",
            "2. UEFI — это разновидность файловой системы, служащей для хранения загрузчиков ОС. Она не заменяет BIOS, а лишь добавляет поддержку Linux. Основное отличие — возможность запускать программы прямо из Windows. BIOS будет основным стандартом ещё десятилетия.",
            "3. UEFI — это утилита тестирования видеокарт, встроенная в Windows. Она отличается от BIOS тем, что позволяет выполнять бенчмарки и управлять GPU. BIOS прекращает существование, так как полностью заменён драйверами DirectX."
        ],
        "correct_answer": "1. UEFI — интерфейс между операционной системой и микропрограммами, управляющими низкоуровневыми функциями оборудования, его основное предназначение: корректно инициализировать оборудование при включении системы и передать управление загрузчику операционной системы. UEFI - это более современное решение,  и оно поддерживает большое количество удобных функций, полезных на современных компьютерах нежели BIOS Благодаря модульной структуре UEFI, новые функции могут быть добавлены позже и тем самым расширить существующую систему. Это делает такую систему более перспективной и простой в использовании. Использовать новые системы UEFI намного проще, у них есть полноценный графический интерфейс с указателем мыши и интуитивно понятным меню. Вы получаете возможность все очень просто настроить. Кроме того, производители материнских плат могут разрабатывать различные программные модули UEFI."
    },
    {
        "question13": "Оперативная память, её типы и её характеристики",
        "answers": [
            "1. ОЗУ — постоянная память, предназначенная для хранения файлов ОС. Типы: SSD, HDD и SSHD. Основная характеристика — скорость вращения шпинделя, а также ёмкость. Чем выше эти параметры, тем быстрее работает оперативная память",
            "2. Оперативная память — энергозависимая часть системы компьютерной памяти, в которой во время работы компьютера хранится выполняемый машинный код, входные, выходные и промежуточные данные, обрабатываемые процессором. Характеристики: тип оперативной памяти, объём ОЗУ, тактовая частота, тайминги. Типы : статистическая SRAM, динамическая DRAM.",
            "3. Оперативная память относится к встроенной памяти процессора. Типы ограничены L1, L2 и L3, а их параметры определяются количеством транзисторов. Работа ОЗУ определяется исключительно скоростью процессора."
        ],
        "correct_answer": "2. Оперативная память — энергозависимая часть системы компьютерной памяти, в которой во время работы компьютера хранится выполняемый машинный код, входные, выходные и промежуточные данные, обрабатываемые процессором. Характеристики: тип оперативной памяти, объём ОЗУ, тактовая частота, тайминги. Типы : статистическая SRAM, динамическая DRAM."
    },
    {
        "question14": "Код коррекции ошибок в ОЗУ. Перспективы развития ОЗУ",
        "answers": [
            "1. ECC - (код коррекции ошибок) позволяет не только выявлять ошибки, но и исправлять их в одном разряде. Поэтому система, которая использует такие коды, в случае появления ошибки в одном разряде способна продолжить работу без прерывания, при этом информация не будет искажена. Реализуется механизм Hamming или более сложные коды. Перспективы: после DDR5 будет HBM новая память уже используемая в топовых видеокартах от амд. Вырос объем, скорость работы, работает на более низких напряжениях.",
            "2. ECC - коррекция ошибок в ОЗУ выполняется исключительно на уровне ОС, путём проверки контрольной суммы файла подкачки. ECC-коды не используются, так как память не допускает ошибок. Развитие ОЗУ связано с увеличением срока службы за счёт применения керамических модулей.",
            "3. ECC - коррекция ошибок осуществляется процессором через регистры общего назначения. ОЗУ само не содержит кодов коррекции. Будущее — это полный отказ от оперативной памяти и переход к хранению данных только на SSD."
        ],
        "correct_answer": "1. ECC - (код коррекции ошибок) позволяет не только выявлять ошибки, но и исправлять их в одном разряде. Поэтому система, которая использует такие коды, в случае появления ошибки в одном разряде способна продолжить работу без прерывания, при этом информация не будет искажена. Перспективы: после DDR5 будет HBM новая память уже используемая в топовых видеокартах от амд. Вырос объем, скорость работы, работает на более низких напряжениях."
    },
    {
        "question15": "Понятие шины, ее эволюция, пропускная способность PCe",
        "answers": [
            "1. Шина — подсистема, служащая для передачи данных между функциональными блоками компьютера. В устройстве шины можно различить механический, электрический (физический) и логический (управляющий) уровни. Эволюция компьютерных шин: 1984- Industry Standard Architecture (ISA) bus, 1992 Peripheral - component interconnect (PCI) bus, 1996 - Accelerate graphical port (AGP) bus, 2004 - Peripheral component interconnect express (PCIe) bus, 1981- PC/XT bus, 1988 - Extended Industry Standard Architecture (EISA) bus. PCI Express (PCIe) — компьютерная шина, использующая программную модель шины PCI и высокопроизводительный физический протокол, основанный на последовательной передаче данных.",
            "2. Шина — это только кабель, соединяющий видеокарту с мониторами. Эволюция включает VGA, DVI и HDMI. Пропускная способность PCIe зависит от длины кабеля и составляет максимум 1 Гбит/с. Эволюция: ISA → PCI → PCI-X → PCI Express. PCIe использует последовательные дифференциальные линии (lanes). Пропускная способность увеличивается с поколениями: PCIe 3.0 (8 GT/s), 4.0 (16 GT/s), 5.0 (32 GT/s), 6.0 (64 GT/s).",
            "3. Шина — это раздел системного блока, в котором размещаются карты расширения. Эволюции не было, так как стандарт PCI остаётся неизменным. Пропускная способность PCIe определяется количеством установленных вентиляторов."
        ],
        "correct_answer": "1. Шина — подсистема, служащая для передачи данных между функциональными блоками компьютера. В устройстве шины можно различить механический, электрический (физический) и логический (управляющий) уровни. Эволюция компьютерных шин: 1984- Industry Standard Architecture (ISA) bus, 1992 Peripheral - component interconnect (PCI) bus, 1996 - Accelerate graphical port (AGP) bus, 2004 - Peripheral component interconnect express (PCIe) bus, 1981- PC/XT bus, 1988 - Extended Industry Standard Architecture (EISA) bus. PCI Express (PCIe) — компьютерная шина, использующая программную модель шины PCI и высокопроизводительный физический протокол, основанный на последовательной передаче данных."
    },
    {
        "question16": "Хост-адаптер шины (HBA), разновидности, практика применения",
        "answers": [
            "1. HBA — это контроллер, обеспечивающий взаимодействие сервера с высокоскоростными системами хранения: SAS, Fibre Channel, NVMe-oF. Разновидности: SAS-HBA, FC-HBA, NVMe-HBA. Применяются в дата-центрах, SAN, корпоративных СХД для высокой надёжности и пропускной способности.",
            "2. HBA — это переходник HDMI → USB, позволяющий подключать ноутбуки к телевизорам. Основные разновидности — mini-HDMI и micro-HDMI. Используется в бытовой электронике.",
            "3. HBA — это устройство охлаждения, устанавливаемое рядом с процессором для отвода тепла. Разновидности — воздушные и водяные. Применяется для предотвращения перегрева."
        ],
        "correct_answer": "1. HBA — это контроллер, обеспечивающий взаимодействие сервера..."
    },
    {
        "question17": "Сокеты для ЦПУ, их классификация и характеристики",
        "answers": [
            "1. Сокет — гнездовой или щелевой разъём в материнской плате, предназначенный для установки в него ЦПУ. На физическом уровне, разъёмы отличаются: количеством контактов, типом этих самых контактов, расстоянием креплений для процессорных кулеров, собственно размером самого сокета. Классификация сокетов (посадочных мест под ЦПУ): 1.Ранние универсальные сокеты 2.Разъёмы (сокеты) под производителя ЦПУ (Intel, AMD и др.) 3.Щелевые разъёмы под производителя ЦПУ (специализированные сокеты – на серверных и др. платформах, на специализированных посадочных местах, для многотерминальных ВМ) 4.Разъёмы мобильных процессоров под производителя ЦПУ (Intel, AMD и др.)",
            "2. Сокет — это модуль охлаждения, устанавливаемый на материнскую плату. Классификация основана на типе вентилятора и скорости вращения. Характеристики — диаметр пропеллера.",
            "3. Сокет — тип корпуса процессора, не связанный с материнской платой. Все сокеты универсальны и подходят для любых CPU."
        ],
        "correct_answer": "1. Сокет — гнездовой или щелевой разъём в материнской плате, предназначенный для установки в него ЦПУ. На физическом уровне, разъёмы отличаются: количеством контактов, типом этих самых контактов, расстоянием креплений для процессорных кулеров, собственно размером самого сокета. Классификация сокетов (посадочных мест под ЦПУ): 1.Ранние универсальные сокеты 2.Разъёмы (сокеты) под производителя ЦПУ (Intel, AMD и др.) 3.Щелевые разъёмы под производителя ЦПУ (специализированные сокеты – на серверных и др. платформах, на специализированных посадочных местах, для многотерминальных ВМ) 4.Разъёмы мобильных процессоров под производителя ЦПУ (Intel, AMD и др.)"
    },
    {
        "question18": "Основные компоненты современных ВМ, предназначение и характеристики",
        "answers": [
            "1. Основные компоненты ВМ — только видеокарта, так как она выполняет вычисления. Остальные части носят декоративный характер.",
            "2. Основные компоненты — корпус, монитор и клавиатура, а также операционная система. Их характеристики определяются цветом корпуса и длиной кабеля.",
            "3. Основные компоненты: ЦПУ (обработка команд), ОЗУ (оперативное хранение данных), материнская плата (магистраль взаимодействия), дисковая подсистема SSD/HDD (не очищается после перезагрузки или выключения компьютера, является энергонезависимой), видеокарта (отвечает за формирование и вывод изображения на экран монитора), БП (служит для снабжения постоянным током всех других компонентов компьютера, преобразуя сетевое напряжения до требуемых значений), сетевой адаптер (служит для подключения компьютера к внутренней сети и к интернету), дисковод(служит для чтения CD/DVD/Blu-Ray дисков)."
        ],
        "correct_answer": "3. Основные компоненты: ЦПУ (обработка команд), ОЗУ (оперативное хранение данных), материнская плата (магистраль взаимодействия), дисковая подсистема SSD/HDD (не очищается после перезагрузки или выключения компьютера, является энергонезависимой), видеокарта (отвечает за формирование и вывод изображения на экран монитора), БП (служит для снабжения постоянным током всех других компонентов компьютера, преобразуя сетевое напряжения до требуемых значений), сетевой адаптер (служит для подключения компьютера к внутренней сети и к интернету), дисковод(служит для чтения CD/DVD/Blu-Ray дисков)."
    },
    {
        "question19": "Блок питания ВМ, классификация и характеристики",
        "answers": [
            "1. БП — вторичный источник электропитания, предназначенный для снабжения узлов компьютера электроэнергией постоянного тока путём преобразования сетевого напряжения 220В до требуемых значений. Классификация: Форм-фактор (ATX, SFX, TFX, FLEX), Мощность (200-400 Вт, 450-650 Вт, 700 Вт и выше), Разъемы для подключения комплектующих (для процессора 4 pin и 8 pin, для видеокарты 6 pin и 8 pin, для накопителей 15-pin SATA). По их применению: 1. БП ВМ с поддержкой горячей замены в отказоустойчивом сервере или др. устройствах. 2. БП для мобильных устройств, ноутбуков, нетбуков, моноблоков и др ВМ. По дополнительным параметрам: 1. Сертификат 80 PLUS (определяет эффективность работы БП, его КПД, список сертификатов 80 PLUS: базовый, BRONZE, SILVER, GOLD, PLATINUM, TITANUM) 2. Тип системы охлаждения (активные и пассивные) 3. Отстыковывающиеся кабели.",
            "2. БП — это батарея внутри системного блока для сохранения данных. Классифицируется по ёмкости и количеству элементов. Характеристики — напряжение заряда.",
            "3. БП — часть видеокарты, отвечающая за вывод изображения. Классификация основана на типе видеовыхода (HDMI/DVI)."
        ],
        "correct_answer": "1. БП — вторичный источник электропитания, предназначенный для снабжения узлов компьютера электроэнергией постоянного тока путём преобразования сетевого напряжения 220В до требуемых значений. Классификация: Форм-фактор (ATX, SFX, TFX, FLEX), Мощность (200-400 Вт, 450-650 Вт, 700 Вт и выше), Разъемы для подключения комплектующих (для процессора 4 pin и 8 pin, для видеокарты 6 pin и 8 pin, для накопителей 15-pin SATA). По их применению: 1. БП ВМ с поддержкой горячей замены в отказоустойчивом сервере или др. устройствах. 2. БП для мобильных устройств, ноутбуков, нетбуков, моноблоков и др ВМ. По дополнительным параметрам: 1. Сертификат 80 PLUS (определяет эффективность работы БП, его КПД, список сертификатов 80 PLUS: базовый, BRONZE, SILVER, GOLD, PLATINUM, TITANUM) 2. Тип системы охлаждения (активные и пассивные) 3. Отстыковывающиеся кабели."
    },
    {
        "question20": "Методики расчета требуемой мощности блоков питания ВМ, выбор БП",
        "answers": [
            "1. Ручной метод - заключается в получении значения общей потребляемой мощности всеми компонентами ПК. Для более точного значения, мощность компонентов можно найти на сайте производителя. Расчет с помощью дополнительных ПО: помощью специальных программ (KSA Power Supply Calculator WorkStation v.2.0).",
            "2. Мощность БП вычисляют по количеству установленных вентиляторов, умноженных на два. Главное — чтобы блок питания был самым тяжёлым.",
            "3. Мощность определяется цветом корпуса: чем темнее, тем мощнее. Запас мощности не требуется."
        ],
        "correct_answer": "1. Ручной метод - заключается в получении значения общей потребляемой мощности всеми компонентами ПК. Для более точного значения, мощность компонентов можно найти на сайте производителя. Расчет с помощью дополнительных ПО: помощью специальных программ (KSA Power Supply Calculator WorkStation v.2.0)"
    },
    {
        "question21": "Материнские платы ВМ, классификация, форм-факторы",
        "answers": [
            "1. Материнская плата служит только для хранения BIOS. Форм-факторов не существует, так как все платы одинаковые.",
            "2. Материнская плата — модуль охлаждения внутри ПК. Классифицируется по количеству трубок. Форм-фактор определяется размером вентилятора.",
            "3. Материнская плата — основная печатная плата, объединяющая компоненты системы. Форм-фактор материнской платы — стандарт, определяющий размеры материнской платы для персонального компьютера, места её крепления к корпусу, а также расположение разъемов ввода/вывода, количества слотов под оперативную память. Классификация: по форм-фактору (ATX, microATX, Mini-ITX, E-ATX), по платформе (Intel/AMD), по уровню (бюджетные, игровые, рабочие станции). Характеристики включают количество слотов памяти, PCIe линий, фаз питания, интерфейсов."
        ],
        "correct_answer": "3. Материнская плата — основная печатная плата, объединяющая компоненты системы. Форм-фактор материнской платы — стандарт, определяющий размеры материнской платы для персонального компьютера, места её крепления к корпусу, а также расположение разъемов ввода/вывода, количества слотов под оперативную память. Классификация: по форм-фактору (ATX, microATX, Mini-ITX, E-ATX), по платформе (Intel/AMD), по уровню (бюджетные, игровые, рабочие станции). Характеристики включают количество слотов памяти, PCIe линий, фаз питания, интерфейсов."
    },
    {
        "question22": "Корпуса ПК, классификация, форм-факторы",
        "answers": [
            "1. Корпуса ПК можно классифицировать по различным наборам отсеков для накопителей информации (HDD/SSD), количеству мест для установки вентиляторов, а также сколько слотов для установки видеокарты может предоставить тот или иной корпус. В общем плане классификация корпусов идет по размеру. Корпус обеспечивает размещение и охлаждение компонентов, а также организацию воздушного потока.",
            "2. Корпуса ПК классифицируются исключительно по материалу изготовления: стальные, пластиковые и стеклянные. Форм-факторы зависят только от количества установленных вентиляторов. Основная задача корпуса — усиливать мощность блока питания.",
            "3. Корпуса ПК подразделяются на вертикальные и горизонтальные, при этом форм-фактор определяется длиной кабеля питания. Большинство корпусов универсальны и не требуют выбора под материнскую плату."
        ],
        "correct_answer": "1. Корпуса ПК можно классифицировать по различным наборам отсеков для накопителей информации (HDD/SSD), количеству мест для установки вентиляторов, а также сколько слотов для установки видеокарты может предоставить тот или иной корпус. В общем плане классификация корпусов идет по размеру. Корпус обеспечивает размещение и охлаждение компонентов, а также организацию воздушного потока."
    },
    {
        "question23": "Логическая схема устройства материнской платы",
        "answers": [
            "1. Логическая схема материнской платы включает центральный процессор, северный и южный мосты (или их современные аналоги — чипсет PCH), контроллеры интерфейсов, слоты расширения, каналы памяти, линии PCIe, подсистему питания VRM. Она определяет взаимодействие всех компонентов, маршрутизацию сигналов и распределение ресурсов.",
            "2. Логическая схема материнской платы содержит только процессор и видеокарту, соединённые напрямую без промежуточных контроллеров. Остальные устройства подключаются через BIOS. Современные платы не используют шины данных.",
            "3. Логическая схема определяется исключительно блоком питания, который управляет компонентами через кабели питания. Чипсет размещён на видеокарте и отвечает за работу дисплея."
        ],
        "correct_answer": "1. Логическая схема материнской платы включает центральный процессор, северный и южный мосты (или их современные аналоги — чипсет PCH), контроллеры интерфейсов, слоты расширения, каналы памяти, линии PCIe, подсистему питания VRM. Она определяет взаимодействие всех компонентов, маршрутизацию сигналов и распределение ресурсов."
    },
    {
        "question24": "Классификация устройств хранения информации, предназначение, перспективы",
        "answers": [
            "1. Устройства хранения бывают только двух типов: флешки и жёсткие диски. Все они работают одинаково и различаются лишь цветом корпуса. Перспектив развития нет.",
            "2. Устройства хранения делятся на магнитные (HDD), твердотельные (SSD), оптические (CD/DVD/BD), ленточные, сетевые (NAS/SAN). Предназначение — долговременное хранение данных различной ёмкости и скорости доступа. Перспективы — расширение объёма, появление новых типов энергонезависимой памяти (3D-NAND, 3D-XPoint, MRAM), рост скорости обмена.",
            "3. Устройства хранения классифицируются по размеру экрана и числу кнопок управления. Хранение данных осуществляется только на магнитных дисках."
        ],
        "correct_answer": "2. Устройства хранения делятся на магнитные (HDD), твердотельные (SSD), оптические (CD/DVD/BD), ленточные, сетевые (NAS/SAN). Предназначение — долговременное хранение данных различной ёмкости и скорости доступа. Перспективы — расширение объёма, появление новых типов энергонезависимой памяти (3D-NAND, 3D-XPoint, MRAM), рост скорости обмена."
    },
    {
        "question25": "Назначение, устройство, характеристики HDD. Перспективы развития",
        "answers": [
            "1. HDD — магнитный накопитель, состоящий из шпинделя, магнитных пластин, блока головок и контроллера. Характеристики: ёмкость, скорость вращения (5400/7200/10000 RPM), скорость обмена, задержки, надёжность, фирма - производитель, размер кэш-памяти. Перспективы — рост плотности записи, технологии HAMR/ MAMR, увеличение объёмов до десятков терабайт.",
            "2. HDD — оптическое устройство, использующее лазер для записи данных. Характеристики сводятся к яркости лазера. Перспективы — переход на цветные лазеры.",
            "3. HDD — твердотельный накопитель, не имеющий движущихся частей. Перспектив развития нет, так как технология полностью заменена SSD."
        ],
        "correct_answer": "1. HDD — магнитный накопитель, состоящий из шпинделя, магнитных пластин, блока головок и контроллера. Характеристики: ёмкость, скорость вращения (5400/7200/10000 RPM), скорость обмена, задержки, надёжность, фирма - производитель, размер кэш-памяти. Перспективы — рост плотности записи, технологии HAMR/ MAMR, увеличение объёмов до десятков терабайт."
    },
    {
        "question26": "Назначение, устройство, классификация SDD. Перспективы развития",
        "answers": [
            "1. SSD — твердотельный накопитель без механики. Основные элементы: контроллер, микросхемы NAND-флеш, буфер DRAM (если есть). Классификация: SATA SSD, NVMe SSD, M.2/PCIe SSD. Перспективы — увеличение ресурса ячеек, переход на QLC/PLC, рост пропускной способности интерфейсов (PCIe 5.0/6.0). Так что в настоящее время SSD может применяться только в тех областях, где HDD значительно уступает в качественных характеристиках. И на развитие SSD повлияет, в первую очередь, не энергопотребление и скорость работы, а размеры.",
            "2. SSD — магнитный накопитель, использующий вращающиеся пластины и лазерный луч для записи. Классификация основана на количестве пластин. Перспективы — уменьшение скорости вращения.",
            "3. SSD — разновидность оперативной памяти, предназначенная для ускорения видеокарты. Классификация определяется типом охлаждения."
        ],
        "correct_answer": "1. SSD — твердотельный накопитель без механики. Основные элементы: контроллер, микросхемы NAND-флеш, буфер DRAM (если есть). Классификация: SATA SSD, NVMe SSD, M.2/PCIe SSD. Перспективы — увеличение ресурса ячеек, переход на QLC/PLC, рост пропускной способности интерфейсов (PCIe 5.0/6.0). Так что в настоящее время SSD может применяться только в тех областях, где HDD значительно уступает в качественных характеристиках. И на развитие SSD повлияет, в первую очередь, не энергопотребление и скорость работы, а размеры."
    },
    {
        "question27": "Сравнительный анализ устройств хранения данных HDD и SDD",
        "answers": [
            "1. HDD и SSD полностью идентичны по скорости, так как используют одинаковую технологию. Единственное отличие — цвет корпуса.",
            "2. Достоинства HDD: емкие, недорогие, доступные. Недостатки HDD: медленные, боятся механических воздействий, шумные. Достоинства SSD: абсолютно бесшумные, износоустойчивые, очень быстрые, не имеют фрагментации. Недостатки SSD: дорогие, теоретически имеют ограниченный ресурс эксплуатации.",
            "3. SSD всегда проигрывают HDD по скорости, так как не имеют вращающихся частей. HDD быстрее благодаря механике."
        ],
        "correct_answer": "2. Достоинства HDD: емкие, недорогие, доступные. Недостатки HDD: медленные, боятся механических воздействий, шумные. Достоинства SSD: абсолютно бесшумные, износоустойчивые, очень быстрые, не имеют фрагментации. Недостатки SSD: дорогие, теоретически имеют ограниченный ресурс эксплуатации."
    },
    {
        "question28": "RAID системы, классификация, возможности, характеристики, перспективы",
        "answers": [
            "1. RAID — Массив из нескольких дисков, управляемых контроллером, взаимосвязанных скоростными каналами и воспринимаемых внешней системой как единое целое. RAID 0 представлен как дисковый массив повышенной производительности, без отказоустойчивости. RAID 1 определён как зеркальный дисковый массив. RAID 2 зарезервирован для массивов, которые применяют код Хемминга. RAID 3 и 4 используют массив дисков с чередованием и выделенным диском чётности. RAID 5 используют массив дисков с чередованием и невыделенным диском чётности. RAID 6 используют массив дисков с чередованием и двумя независимыми чётностями блоков. RAID 10 — RAID 0, построенный из RAID 1 массивов. RAID 50 — RAID 0, построенный из RAID 5. RAID 60 — RAID 0, построенный из RAID 6",
            "2. RAID — способ охлаждения дисков с помощью вентиляторов. Уровни RAID определяются скоростью вращения. Перспективы — использование водяных блоков.",
            "3. RAID — разновидность оперативной памяти. Используется только в ноутбуках для ускорения Wi-Fi."
        ],
        "correct_answer": "1. RAID — Массив из нескольких дисков, управляемых контроллером, взаимосвязанных скоростными каналами и воспринимаемых внешней системой как единое целое. RAID 0 представлен как дисковый массив повышенной производительности, без отказоустойчивости. RAID 1 определён как зеркальный дисковый массив. RAID 2 зарезервирован для массивов, которые применяют код Хемминга. RAID 3 и 4 используют массив дисков с чередованием и выделенным диском чётности. RAID 5 используют массив дисков с чередованием и невыделенным диском чётности. RAID 6 используют массив дисков с чередованием и двумя независимыми чётностями блоков. RAID 10 — RAID 0, построенный из RAID 1 массивов. RAID 50 — RAID 0, построенный из RAID 5. RAID 60 — RAID 0, построенный из RAID 6"
    },
    {
        "question29": "Классификация современных носителей – накопителей информации",
        "answers": [
            "1. Современные носители классифицируются на магнитные (HDD, ленты), полупроводниковые (SSD, флеш-накопители), оптические (DVD, Blu-Ray), сетевые (NAS-устройства), облачные (S3-хранилища). Отличаются ёмкостью, скоростью, надёжностью и способом подключения.",
            "2. Носители информации делятся только на флешки и CD-диски. Остальные технологии считаются устаревшими.",
            "3. Классификация определяется размером корпуса накопителя. Самые большие устройства — самые быстрые."
        ],
        "correct_answer": "1. Современные носители классифицируются на магнитные (HDD, ленты), полупроводниковые (SSD, флеш-накопители), оптические (DVD, Blu-Ray), сетевые (NAS-устройства), облачные (S3-хранилища). Отличаются ёмкостью, скоростью, надёжностью и способом подключения."
    },
    {
        "question30": "Внутренние и внешние оптические и магнитные накопители информации",
        "answers": [
            "1. HDD – представляет собой группу дисков, имеющих магнитное покрытие и вращающихся вокруг оси с высокой скоростью. Диски заключены в металлический корпус и вращаются с высокой угловой скоростью. Внешние магнитные накопители информации – это запоминающие устройства, которые характеризуются большим объемом хранимой информации и низким быстродействием. Оптические накопители предназначены для чтения и, как правило, записи/перезаписи с оптических дисков. Наиболее распространенные форматы оптических дисков для использования в персональных компьютерах– это CD, DVD, Blu-ray.",
            "2. Оптические накопители существуют только во внешнем виде, внутренние модели запрещены из-за нагрева. Магнитные накопители работают только через WI-FI.",
            "3. Все оптические и магнитные накопители являются внутренними; внешних вариантов не существует."
        ],
        "correct_answer": "1. HDD – представляет собой группу дисков, имеющих магнитное покрытие и вращающихся вокруг оси с высокой скоростью. Диски заключены в металлический корпус и вращаются с высокой угловой скоростью. Внешние магнитные накопители информации – это запоминающие устройства, которые характеризуются большим объемом хранимой информации и низким быстродействием. Оптические накопители предназначены для чтения и, как правило, записи/перезаписи с оптических дисков. Наиболее распространенные форматы оптических дисков для использования в персональных компьютерах– это CD, DVD, Blu-ray."
    },
    {
        "question31": "Типы интерфейсов жестких дисков, их характеристики",
        "answers": [
            "1. Основные интерфейсы: SCSI: SCSI-1 Использовалась восьмибитная шина с пропускной способностью в 1,5 Мбайт/сек в асинхронном режиме и 5 Мбайт/сек в синхронном режиме. Максимальная длина кабеля — до 6 метров. SCSI-2 Fast SCSI характеризуется удвоенной пропускной способностью (до 10 Мбайт/сек). Wide SCSI в дополнение к этому имеет удвоенную разрядность шины (16 бит), что позволяет достичь скорости передачи до 20 МБ/сек. При этом максимальная длина кабеля ограничивалась 3 метрами. SCSI-3 Пропускная способность шины составила 20 Мбайт/сек для 8-ми битной шины и 40 Мбайт/сек — для 16-ти ибитной. Максимальная длина кабеля так и осталась 3 метра. Устройства, отвечающие этому стандарту, известны своей чувствительностью к качеству элементов системы (кабель, терминаторы). Ultra-2 SCSI Использует LVDS. Максимальная длина кабеля — 12 метров, пропускная способность — до 80 Мбайт/сек. Ultra-3 SCSI. SAS/Serial Attached SCSI обеспечивает подключение по физическому интерфейсу, аналогичному SATA, устройств, управляемых набором команд SCSI. SATA - последовательный интерфейс обмена данными с накопителями информации. FC(FibreChannel):Жесткие диски с протоколом подключения, повторяют традиционные SCSI диски, заисключением того, что к контроллеру подключается по оптическому кабелю.",
            "2. Интерфейсы жестких дисков — это HDMI, DisplayPort и USB-C. Они определяют качество видеосигнала.",
            "3. Все жёсткие диски используют одинаковый интерфейс, скорость зависит только от размера корпуса."
        ],
        "correct_answer": "1. Основные интерфейсы: SCSI: SCSI-1 Использовалась восьмибитная шина с пропускной способностью в 1,5 Мбайт/сек в асинхронном режиме и 5 Мбайт/сек в синхронном режиме. Максимальная длина кабеля — до 6 метров. SCSI-2 Fast SCSI характеризуется удвоенной пропускной способностью (до 10 Мбайт/сек). Wide SCSI в дополнение к этому имеет удвоенную разрядность шины (16 бит), что позволяет достичь скорости передачи до 20 МБ/сек. При этом максимальная длина кабеля ограничивалась 3 метрами. SCSI-3 Пропускная способность шины составила 20 Мбайт/сек для 8-ми битной шины и 40 Мбайт/сек — для 16-ти ибитной. Максимальная длина кабеля так и осталась 3 метра. Устройства, отвечающие этому стандарту, известны своей чувствительностью к качеству элементов системы (кабель, терминаторы). Ultra-2 SCSI Использует LVDS. Максимальная длина кабеля — 12 метров, пропускная способность — до 80 Мбайт/сек. Ultra-3 SCSI. SAS/Serial Attached SCSI обеспечивает подключение по физическому интерфейсу, аналогичному SATA, устройств, управляемых набором команд SCSI. SATA - последовательный интерфейс обмена данными с накопителями информации. FC(FibreChannel):Жесткие диски с протоколом подключения, повторяют традиционные SCSI диски, заисключением того, что к контроллеру подключается по оптическому кабелю."
    },
    {
        "question32": "Разновидности систем хранения данных и их особенности, примеры применения",
        "answers": [
            "1. Все системы хранения идентичны и различаются только по цвету корпуса.",
            "2. Системы хранения бывают только облачные и локальные. Облачные применяются для игр, локальные — для просмотра фильмов.",
            "3. Системы хранения делятся на: JBOD — это простой набор дисков, которые видны либо как один последовательный массив, либо как отдельные устройства; DAS — это хранилище, напрямую (например, через SAS или SATA) подключенное к серверу или рабочей станции; NAS — сетевое хранилище, предоставляющее доступ к данным по сетевым протоколам (NFS/SMB), часто построенное на основе DAS; SAN — сеть хранения данных, которая представляет удаленные устройства как локальные, работая на уровне блоков (Fibre Channel, iSCSI), и может сочетаться с функционалом NAS."
        ],
        "correct_answer": "3. Системы хранения делятся на: JBOD — это простой набор дисков, которые видны либо как один последовательный массив, либо как отдельные устройства; DAS — это хранилище, напрямую (например, через SAS или SATA) подключенное к серверу или рабочей станции; NAS — сетевое хранилище, предоставляющее доступ к данным по сетевым протоколам (NFS/SMB), часто построенное на основе DAS; SAN — сеть хранения данных, которая представляет удаленные устройства как локальные, работая на уровне блоков (Fibre Channel, iSCSI), и может сочетаться с функционалом NAS."
    },
    {
        "question33": "СХД, связанные с сервером. Структура и характеристики",
        "answers": [
            "1. Серверные СХД включают контроллеры, дисковые полки, кэш-модули, интерфейсы SAS/FC/NVMe, механизмы резервирования, RAID-массивы. Характеристики: производительность (IOPS), пропускная способность, задержки, отказоустойчивость, масштабируемость.",
            "2. Серверные СХД — это обычные флешки, подключённые к USB-порту. Характеристики — ёмкость.",
            "3. СХД сервера располагается на видеокарте и управляется драйвером DirectX."
        ],
        "correct_answer": "1. Серверные СХД включают контроллеры, дисковые полки..."
    },
    {
        "question34": "Сетевое хранение данных. Структура и характеристики. Примеры",
        "answers": [
            "1. DAS (Direct/Server Attached Storage) — это системы хранения, которые подключаются напрямую к серверу. Они отличаются низкой стоимостью, простотой развертывания и высокой скоростью обмена данными между массивом и сервером. Однако у них низкая надёжность: при отказе сервера данные становятся недоступны, свободное место не может быть перераспределено между серверами, а управление и резервирование данных усложнено.",
            "2. DAS — это Wi-Fi роутер с USB-портом. Пример — любой смартфон.",
            "3. DAS используется только для видеостриминга и не поддерживает файловый доступ."
        ],
        "correct_answer": "1. DAS (Direct/Server Attached Storage) — это системы хранения, которые подключаются напрямую к серверу. Они отличаются низкой стоимостью, простотой развертывания и высокой скоростью обмена данными между массивом и сервером. Однако у них низкая надёжность: при отказе сервера данные становятся недоступны, свободное место не может быть перераспределено между серверами, а управление и резервирование данных усложнено."
    },
    {
        "question35": "Cетевое дисковое хранилище, интегрированное с ЛВС через файловый NAS-север",
        "answers": [
            "1. SAN (Storage Area Network) — это архитектура, которая подключает внешние устройства хранения (например, дисковые массивы) к серверам так, что они видны из сети как локальные диски. Она обеспечивает централизованное управление ресурсами, возможность «горячего» добавления оборудования, совместное использование устройств и разгрузку основной сети. Это ускоряет резервное копирование, восстановление данных и даёт удалённым серверам быстрый и надёжный доступ к хранилищу без потери производительности.",
            "2. SAN (Storage Area Network)— это отдельная видеокарта, предоставляющая доступ к изображениям через Ethernet. Используется для ускорения графики.",
            "3. SAN (Storage Area Network) — это разновидность модема, который усиливает сигнал Wi-Fi и хранит временные файлы браузера."
        ],
        "correct_answer": "1. SAN (Storage Area Network) — это архитектура, которая подключает внешние устройства хранения (например, дисковые массивы) к серверам так, что они видны из сети как локальные диски. Она обеспечивает централизованное управление ресурсами, возможность «горячего» добавления оборудования, совместное использование устройств и разгрузку основной сети. Это ускоряет резервное копирование, восстановление данных и даёт удалённым серверам быстрый и надёжный доступ к хранилищу без потери производительности."
    },
    {
        "question36": "Сравнительные характеристики систем хранения данных NAS, SAS (DAS), SAN",
        "answers": [
            "1. NAS работает по файловому уровню, предоставляя доступ по сетевым протоколам (NFS, SMB), SAN — по блочному уровню через FC или iSCSI, а DAS подключается напрямую к серверу и обеспечивает минимальную задержку. NAS проще в администрировании и подходит для общего доступа к файлам, SAN используется в высоконагруженных корпоративных средах, где требуется масштабируемость,低 задержки и большим объёмом операций ввода-вывода, а DAS — это бюджетный вариант для небольших систем и отдельных серверов.",
            "2. NAS и SAN работают исключительно по файловому уровню, но отличаются только длиной кабеля подключения, тогда как DAS использует облачные протоколы и не зависит от физической инфраструктуры.",
            "3. SAN всегда медленнее NAS, поскольку использует только медные соединения, а NAS быстрее, так как работает через Wi-Fi; DAS же является промежуточным типом системы и применяется только в ноутбуках."
        ],
        "correct_answer": "1. NAS работает по файловому уровню, предоставляя доступ по сетевым протоколам (NFS, SMB), SAN — по блочному уровню через FC или iSCSI, а DAS подключается напрямую к серверу и обеспечивает минимальную задержку. NAS проще в администрировании и подходит для общего доступа к файлам, SAN используется в высоконагруженных корпоративных средах, где требуется масштабируемость,低 задержки и большим объёмом операций ввода-вывода, а DAS — это бюджетный вариант для небольших систем и отдельных серверов."
    },
    {
        "question37": "Инновации в системах хранения данных. СХД на ДНК",
        "answers": [
            "1. Ключевые инновации в СХД включают: широкое внедрение высокоскоростных и энергоэффективных SSD; виртуализацию ресурсов для снижения затрат и повышения гибкости; технологии энергосбережения и гарантированного сохранения данных при сбоях питания. Развиваются механизмы прогнозирования сбоев и замены дисков без простоя, бесшовного расширения хранилищ, а также упрощённого развёртывания и управления через специализированное ПО и микрокод, что значительно сокращает время настройки и эксплуатации.",
            "2. СХД на ДНК представляет собой биологические жёсткие диски, которые работают на основе магнитных бактерий. Информация записывается с помощью специальных магнитных белков, что позволяет мгновенно записывать и считывать данные, а стоимость таких систем минимальна.",
            "3. Технология хранения на ДНК используется только для временного кэширования, так как молекулы ДНК быстро разрушаются от любой нагрузки, а объём хранения ограничивается несколькими мегабайтами."
        ],
        "correct_answer": "1. Ключевые инновации в СХД включают: широкое внедрение высокоскоростных и энергоэффективных SSD; виртуализацию ресурсов для снижения затрат и повышения гибкости; технологии энергосбережения и гарантированного сохранения данных при сбоях питания. Развиваются механизмы прогнозирования сбоев и замены дисков без простоя, бесшовного расширения хранилищ, а также упрощённого развёртывания и управления через специализированное ПО и микрокод, что значительно сокращает время настройки и эксплуатации."
    },
    {
        "question38": "Компьютерные сети, типы сетей",
        "answers": [
            "1. Компьютерная сеть - это набор узлов, соединённых каналами связи с сетевыми устройствами. Устройства соединены разными типами каналов связи: медные кабели, волоконно-оптические, беспрповодные подключения. Типы сетей: PAN (личная), WLAN(Беспроводная LAN), LAN (локальная), MAN (муниципальная), WAN (глобальная), одноранговые сети, клиент-серверные сети. LAN обеспечивает высокую скорость и используется в зданиях и офисах, MAN объединяет районы и города, а WAN может охватывать страны и континенты.",
            "2. Сети подразделяются только на Wi-Fi и Bluetooth, причём Wi-Fi всегда относится к глобальным сетям, а Bluetooth — к локальным. Других типов сетей не существует.",
            "3. Компьютерные сети делятся на офисные и домашние, при этом офисные всегда быстрее, а домашние всегда беспроводные."
        ],
        "correct_answer": "1. Компьютерная сеть - это набор узлов, соединённых каналами связи с сетевыми устройствами. Устройства соединены разными типами каналов связи: медные кабели, волоконно-оптические, беспрповодные подключения. Типы сетей: PAN (личная), WLAN(Беспроводная LAN), LAN (локальная), MAN (муниципальная), WAN (глобальная), одноранговые сети, клиент-серверные сети. LAN обеспечивает высокую скорость и используется в зданиях и офисах, MAN объединяет районы и города, а WAN может охватывать страны и континенты."
    },
    {
        "question39": "Типы устройств и сред в сетях. Назначение, возможности и характеристики",
        "answers": [
            "1. Основные устройства сетей включают коммутаторы, маршрутизаторы, точки доступа, медиаконвертеры. Сетевые среды — медные кабели (витая пара), оптоволокно и беспроводные каналы. Медные кабели подходят для бюджетных и средних решений, оптоволокно обеспечивает высокую скорость и дальность, беспроводные сети дают гибкость, но зависят от помех. Устройства обеспечивают сегментацию, маршрутизацию, усиление сигнала и преобразование среды.",
            "2. Устройства и среды в сетях ограничиваются только беспроводными маршрутизаторами, поскольку проводные среды больше не используются. Все современные сети построены исключительно на Wi-Fi.",
            "3. Устройства сетей включают только концентраторы, которые выполняют функции маршрутизаторов, коммутаторов и точек доступа одновременно. Кабельные среды считаются устаревшими и не применяются."
        ],
        "correct_answer": "1. Основные устройства сетей включают коммутаторы, маршрутизаторы, точки доступа, медиаконвертеры. Сетевые среды — медные кабели (витая пара), оптоволокно и беспроводные каналы. Медные кабели подходят для бюджетных и средних решений, оптоволокно обеспечивает высокую скорость и дальность, беспроводные сети дают гибкость, но зависят от помех. Устройства обеспечивают сегментацию, маршрутизацию, усиление сигнала и преобразование среды."
    },
    {
        "question40": "IP адресация в сетях, классы IP адресов. Частные адреса",
        "answers": [
            "1. Классы IP-адресов существуют только в IPv6, а в IPv4 применяется исключительно автоматическая адресация без деления на диапазоны.",
            "2. Все IP-адреса относятся только к одному классу, а частные адреса отсутствуют. Для локальных сетей используется любой диапазон по выбору администратора.",
            "3. IPv4-адреса делятся на классы A, B, C, D, E. Частные диапазоны: 10.0.0.0/8, 172.16.0.0–172.31.0.0/12, 192.168.0.0/16. Частные адреса используются внутри локальных сетей и не маршрутизируются в интернете. Классы определяют размер сетевой и хостовой части и применяются в больших, средних и малых сетях."
        ],
        "correct_answer": "3. IPv4-адреса делятся на классы A, B, C, D, E. Частные диапазоны: 10.0.0.0/8, 172.16.0.0–172.31.0.0/12, 192.168.0.0/16. Частные адреса используются внутри локальных сетей и не маршрутизируются в интернете. Классы определяют размер сетевой и хостовой части и применяются в больших, средних и малых сетях."
    },
    {
        "question41": "Маска подсети. IPv6 адресация",
        "answers": [
            "1. Маска подсети - это параметр, который позволяет определит к какой сети подключён компьютер, выделив из IP адреса сети и адрес узла в сети. Маска подсети по умолчанию определяет сетевую часть IP-адреса. Класс A: 255.0.0.0 (сеть — первый октет), класс B: 255.255.0.0 (сеть — первые два октета), класс C: 255.255.255.0 (сеть — первые три октета). В IPv6 используется 128-битная адресация, основанная на шестнадцатеричном представлении. Она обеспечивает огромный адресный запас, встроенную иерархию, автоконфигурацию SLAAC и отсутствие необходимости NAT.",
            "2. Маска подсети применяется только в IPv6, а IPv4 работает без масок. IPv6 поддерживает всего 16 адресов в одной сети, поэтому используется редко.",
            "3. IPv6 — это устаревшая версия адресации, которая заменена IPv5. Маска подсети не используется ни в одном современном протоколе."
        ],
        "correct_answer": "1. Маска подсети - это параметр, который позволяет определит к какой сети подключён компьютер, выделив из IP адреса сети и адрес узла в сети. Маска подсети по умолчанию определяет сетевую часть IP-адреса. Класс A: 255.0.0.0 (сеть — первый октет), класс B: 255.255.0.0 (сеть — первые два октета), класс C: 255.255.255.0 (сеть — первые три октета). В IPv6 используется 128-битная адресация, основанная на шестнадцатеричном представлении. Она обеспечивает огромный адресный запас, встроенную иерархию, автоконфигурацию SLAAC и отсутствие необходимости NAT."
    },
    {
        "question42": "Протоколы, взаимодействие протоколов, стек протоколов",
        "answers": [
            "1. Протоколы — это физические кабели сети, поэтому взаимодействие протоколов означает подключение разных типов кабелей в один коммутатор.",
            "2. Протоколы — это наборы правил обмена данными. Стек протоколов, например TCP/IP, состоит из уровней, на каждом из которых действуют свои протоколы: канальный (Ethernet), сетевой (IP), транспортный (TCP/UDP), прикладной (HTTP, FTP). Взаимодействие протоколов обеспечивает передачу данных от приложения до физической среды.",
            "3. В современном сетевом оборудовании протоколы не используются, так как все связи происходят на основе прямой аппаратной логики без стека."
        ],
        "correct_answer": "2. Протоколы — это наборы правил обмена данными. Стек протоколов, например TCP/IP, состоит из уровней, на каждом из которых действуют свои протоколы: канальный (Ethernet), сетевой (IP), транспортный (TCP/UDP), прикладной (HTTP, FTP). Взаимодействие протоколов обеспечивает передачу данных от приложения до физической среды."
    },
    {
        "question43": "Сетевые устройства, назначение и характеристики. Варианты применения",
        "answers": [
            "1. К сетевым устройствам относятся маршрутизаторы, коммутаторы, точки доступа, межсетевые экраны, повторители. Коммутаторы сегментируют сеть и работают на канальном уровне, маршрутизаторы выполняют межсетевую маршрутизацию, точки доступа обеспечивают беспроводной доступ. Применяются в домашних, корпоративных и высоконагруженных сетях.",
            "2. Единственное сетевое устройство — маршрутизатор, так как он выполняет функции всех остальных устройств, включая оптоволоконные передатчики и серверы.",
            "3. Коммутаторы используются только в беспроводных сетях, а повторители — в оптоволоконных. Устройства применяются только в дата-центрах, в домашних сетях они не требуются."
        ],
        "correct_answer": "1. К сетевым устройствам относятся маршрутизаторы, коммутаторы, точки доступа, межсетевые экраны, повторители. Коммутаторы сегментируют сеть и работают на канальном уровне, маршрутизаторы выполняют межсетевую маршрутизацию, точки доступа обеспечивают беспроводной доступ. Применяются в домашних, корпоративных и высоконагруженных сетях."
    },
    {
        "question44": "Медные и оптоволоконные типы соединений. Кабели и характеристики. Оконцовка кабелей",
        "answers": [
            "1. Витая пара — это кабель из двух/четырёх перекрученных медных проводов в цветовой изоляции, помещённых в общую оболочку. Скручивание защищает от помех. Кабель бывает экранированным (STP) и неэкранированным (UTP, например, категорий Cat 5e, Cat 6). Коаксиальный кабель состоит из центральной медной жилы в изоляции, окружённой экраном. Его типы включали «толстый» (10Base5, до 500 м) и «тонкий» (10Base2, до 185 м) для сетей 10 Мбит/с, а также RG-59 (для ТВ) и более качественный RG-6 с большей пропускной способностью. Оптоволоконный кабель передаёт данные с помощью света по стеклянным или пластиковым жилам. Он не подвержен электромагнитным помехам, обеспечивает высокую скорость и дальность передачи, но дороже и сложнее в монтаже, чем медный кабель. Основные типы — многомодовый и одномодовый.",
            "2. Все типы кабелей используют один разъём RJ-11, а оптоволокно не требует оконцовки, так как работает на радиоволнах.",
            "3. Оптоволоконные кабели имеют металлический сердечник, а медные — стеклянный. Оконцовка кабелей необязательна, так как соединения выполняются скручиванием проводов."
        ],
        "correct_answer": "1. Витая пара — это кабель из двух/четырёх перекрученных медных проводов в цветовой изоляции, помещённых в общую оболочку. Скручивание защищает от помех. Кабель бывает экранированным (STP) и неэкранированным (UTP, например, категорий Cat 5e, Cat 6). Коаксиальный кабель состоит из центральной медной жилы в изоляции, окружённой экраном. Его типы включали «толстый» (10Base5, до 500 м) и «тонкий» (10Base2, до 185 м) для сетей 10 Мбит/с, а также RG-59 (для ТВ) и более качественный RG-6 с большей пропускной способностью. Оптоволоконный кабель передаёт данные с помощью света по стеклянным или пластиковым жилам. Он не подвержен электромагнитным помехам, обеспечивает высокую скорость и дальность передачи, но дороже и сложнее в монтаже, чем медный кабель. Основные типы — многомодовый и одномодовый."
    },
    {
        "question45": "Понятие топологии. Типы топологий и их примеры. Достоинства и недостатки",
        "answers": [
            "1. Топология сети определяет физическое или логическое расположение устройств и связей. Основные типы: шина, звезда, кольцо, ячеистая, древовидная. Звезда надёжна и проста в управлении, но зависит от центрального устройства. Кольцо обеспечивает равномерность нагрузки, но уязвимо к разрыву. Ячеистая топология максимально отказоустойчивая, но дорогая.",
            "2. Топология — это расположение кабелей внутри стены. Основной тип — линейная топология, где все устройства подключаются последовательно к одному кабелю, и она не имеет недостатков.",
            "3. Существуют только две топологии: круговая и квадратная. Квадратная используется в серверах, а круговая — в домашних сетях."
        ],
        "correct_answer": "1. Топология сети определяет физическое или логическое расположение устройств и связей. Основные типы: шина, звезда, кольцо, ячеистая, древовидная. Звезда надёжна и проста в управлении, но зависит от центрального устройства. Кольцо обеспечивает равномерность нагрузки, но уязвимо к разрыву. Ячеистая топология максимально отказоустойчивая, но дорогая."
    },
    {
        "question46": "Модели передачи данных. Сравнение моделей OSI и TCP/IP",
        "answers": [
            "1. OSI состоит из 7 уровней, TCP/IP — из 4. В OSI уровни чётко разделены, в TCP/IP некоторые уровни объединены. OSI используется как теоретическая модель, TCP/IP — как практическая, применяемая в интернете. Основные различия касаются структуры уровней и подходов к инкапсуляции данных.",
            "2. Модель TCP/IP полностью заменяет OSI, поэтому OSI больше не изучается. TCP/IP состоит из 12 уровней, каждый из которых строго соответствует одному кабельному типу.",
            "3. OSI и TCP/IP — это разные типы операционных систем, которые конкурируют друг с другом. Модель передачи данных к ним не относится."
        ],
        "correct_answer": "1. OSI состоит из 7 уровней, TCP/IP — из 4. В OSI уровни чётко разделены, в TCP/IP некоторые уровни объединены. OSI используется как теоретическая модель, TCP/IP — как практическая, применяемая в интернете. Основные различия касаются структуры уровней и подходов к инкапсуляции данных."
    },
    {
        "question47": "Модель OSI. Организации по стандартам.",
        "answers": [
            "1. Модель OSI включает 7 уровней: физический, канальный, сетевой, транспортный, сеансовый, представления, прикладной. За стандартизацию отвечают ISO, ANSI, IEEE, ITU-T. OSI обеспечивает универсальный подход к сетевому взаимодействию и описывает функции каждого уровня.",
            "2. Модель OSI состоит из 3 уровней, разработана исключительно IEEE и применяется только в беспроводных сетях.",
            "3. OSI — это набор кабельных стандартов, разработанный производителями сетевых карт. Она описывает только физическую среду и не затрагивает передачу данных."
        ],
        "correct_answer": "1. Модель OSI включает 7 уровней: физический, канальный, сетевой, транспортный, сеансовый, представления, прикладной. За стандартизацию отвечают ISO, ANSI, IEEE, ITU-T. OSI обеспечивает универсальный подход к сетевому взаимодействию и описывает функции каждого уровня."
    },
    {
        "question48": "Оптоволокно и беспроводная связь. Характеристики и стандарты",
        "answers": [
            "1. Оптоволокно обеспечивает высокую скорость, защиту от помех и передачу данных на десятки километров. Типы: одномодовое и многомодовое. Беспроводная связь использует радиодиапазоны, подвержена помехам и имеет стандарты Wi-Fi (802.11), Bluetooth, LTE, 5G. Каждая технология имеет свои частоты, пропускную способность и особенности применения.",
            "2. Беспроводная связь всегда быстрее оптоволокна, так как не требует кабеля. Стандарты Wi-Fi полностью заменили все проводные технологии, включая оптические.",
            "3. Оптоволокно используется только в домашних роутерах, а беспроводная связь применяется исключительно для подключения серверов в дата-центрах."
        ],
        "correct_answer": "1. Оптоволокно обеспечивает высокую скорость, защиту от помех и передачу данных на десятки километров. Типы: одномодовое и многомодовое. Беспроводная связь использует радиодиапазоны, подвержена помехам и имеет стандарты Wi-Fi (802.11), Bluetooth, LTE, 5G. Каждая технология имеет свои частоты, пропускную способность и особенности применения."
    },
    {
        "question49": "Стандарты IEEE 802.3 для сетей Ethernet",
        "answers": [
            "1. IEEE 802.3 — стандарт проводной сети Ethernet, включающий различные версии: 10BASE-T, 100BASE-TX, 1000BASE-T, 10GBASE-SR, 40GBASE-LR и другие. Они определяют скорость, тип кабеля, расстояние передачи и разъёмы. Стандарты обеспечивают совместимость оборудования разных производителей.",
            "2. Стандарт 802.3 относится исключительно к беспроводным технологиям и определяет правила работы Wi-Fi-сетей.",
            "3. IEEE 802.3 — это стандарт для USB-устройств, который описывает передачу данных между компьютером и периферийными устройствами."
        ],
        "correct_answer": "1. IEEE 802.3 — стандарт проводной сети Ethernet, включающий различные версии: 10BASE-T, 100BASE-TX, 1000BASE-T, 10GBASE-SR, 40GBASE-LR и другие. Они определяют скорость, тип кабеля, расстояние передачи и разъёмы. Стандарты обеспечивают совместимость оборудования разных производителей."
    },
    {
        "question50": "Физический уровень модели OSI. Виды передаваемых сигналов",
        "answers": [
            "1. Физический уровень отвечает за передачу необработанных битов по физической среде. Он определяет параметры электрических, оптических или радиосигналов: уровни напряжения, частоты, типы модуляции, характеристики кабелей и разъемов. Сигналы могут быть аналоговыми и цифровыми; цифровые представляют собой дискретные состояния, а аналоговые — непрерывные изменения параметров. Также физический уровень задаёт скорость передачи, дальность и форматы кодирования (NRZ, Manchester, 4B/5B и др.).",
            "2. Физический уровень выполняет маршрутизацию пакетов и отвечает за работу коммутаторов. Передаваемые сигналы на нём исключительно цифровые и имеют строго фиксированную частоту 50 Гц, как в бытовой электрической сети.",
            "3. Физический уровень OSI служит для преобразования данных в готовые сетевые пакеты и их последующего шифрования. Передаются только аналоговые сигналы, так как цифровые считаются слишком шумными."
        ],
        "correct_answer": "1. Физический уровень отвечает за передачу необработанных битов по физической среде. Он определяет параметры электрических, оптических или радиосигналов: уровни напряжения, частоты, типы модуляции, характеристики кабелей и разъемов. Сигналы могут быть аналоговыми и цифровыми; цифровые представляют собой дискретные состояния, а аналоговые — непрерывные изменения параметров. Также физический уровень задаёт скорость передачи, дальность и форматы кодирования (NRZ, Manchester, 4B/5B и др.)."
    },
    {
        "question51": "Канальный уровень и его подуровни. Преобразование кадров данных",
        "answers": [
            "1. Канальный уровень состоит из двух подуровней: LLC (Logical Link Control) и MAC (Media Access Control). LLC отвечает за управление логическим соединением и взаимодействие с сетевым уровнем, а MAC — за доступ к среде передачи, формирование и разбор кадров. Кадры данных включают заголовки, служебную информацию, MAC-адреса и контрольные суммы. Канальный уровень обеспечивает обнаружение ошибок, управление доступом к среде и сегментацию данных в кадры.",
            "2. Канальный уровень имеет только один подуровень MAC, который отвечает за маршрутизацию IP-пакетов по всей сети. Преобразование кадров выполняется только на сетевом уровне, а канальный уровень лишь пересылает байты без анализа.",
            "3. Канальный уровень применяется только в беспроводных сетях. Подуровни LLC и MAC используются для шифрования данных, а кадры представляют собой зашифрованные фрагменты, которые проходят через транспортный уровень."
        ],
        "correct_answer": "1. Канальный уровень состоит из двух подуровней: LLC (Logical Link Control) и MAC (Media Access Control). LLC отвечает за управление логическим соединением и взаимодействие с сетевым уровнем, а MAC — за доступ к среде передачи, формирование и разбор кадров. Кадры данных включают заголовки, служебную информацию, MAC-адреса и контрольные суммы. Канальный уровень обеспечивает обнаружение ошибок, управление доступом к среде и сегментацию данных в кадры."
    },
    {
        "question52": "Сетевой уровень модели OSI. Четыре процесса сетевого уровня",
        "answers": [
            "1. Сетевой уровень отвечает за маршрутизацию, логическую адресацию и определение пути передачи. Основные процессы включают: маршрутизацию пакетов, фрагментацию и сборку пакетов, управление перегрузками и логическую адресацию. Этот уровень обеспечивает доставку данных между различными сетями посредством протоколов, таких как IP.",
            "2. Сетевой уровень выполняет только функцию преобразования кадров в сигналы. Четыре его процесса: шифрование, управление паролями, авторизация и аудиокодирование.",
            "3. Основной задачей сетевого уровня является передача данных внутри одного коммутатора. Четыре процесса — это настройка Wi-Fi, работа DHCP, включение маршрутизатора и проверка скорости интернета."
        ],
        "correct_answer": "1. Сетевой уровень отвечает за маршрутизацию, логическую адресацию и определение пути передачи. Основные процессы включают: маршрутизацию пакетов, фрагментацию и сборку пакетов, управление перегрузками и логическую адресацию. Этот уровень обеспечивает доставку данных между различными сетями посредством протоколов, таких как IP."
    },
    {
        "question53": "Транспортный уровень модели OSI и его функции",
        "answers": [
            "1. Транспортный уровень обеспечивает надёжную или ненадёжную передачу данных между конечными устройствами. Основные функции: установление, сопровождение и завершение соединения; сегментирование данных; управление потоком; контроль ошибок; повторная передача потерянных сегментов (в TCP). Также транспортный уровень поддерживает мультиплексирование соединений с помощью номеров портов.",
            "2. Транспортный уровень занимается исключительно преобразованием физических сигналов в цифровые данные. Он не использует порты и не может устанавливать соединения.",
            "3. Транспортный уровень используется только в беспроводных сетях и отвечает за усиление радиосигнала. Управление потоком и контроль ошибок выполняются на физическом уровне."
        ],
        "correct_answer": "1. Транспортный уровень обеспечивает надёжную или ненадёжную передачу данных между конечными устройствами. Основные функции: установление, сопровождение и завершение соединения; сегментирование данных; управление потоком; контроль ошибок; повторная передача потерянных сегментов (в TCP). Также транспортный уровень поддерживает мультиплексирование соединений с помощью номеров портов."
    },
    {
        "question54": "Уровень приложений модели OSI и его функции",
        "answers": [
            "1. Прикладной уровень обеспечивает взаимодействие пользовательских приложений с сетью. Он включает множество протоколов: HTTP, FTP, SMTP, DNS, Telnet. Основные функции: предоставление сервисов для работы приложений, интерпретация запросов, поддержка удалённого доступа, обмен файлами, управление почтой и именами ресурсов. Он работает с данными в форме наиболее близкой к пользователю.",
            "2. Прикладной уровень отвечает за физическую передачу сигналов и работу кабельных стандартов. В его функции входит управление MAC-адресами и маршрутизация пакетов.",
            "3. Уровень приложений работает только внутри браузеров и обеспечивает отображение веб-страниц. Другие программы к нему не имеют отношения."
        ],
        "correct_answer": "1. Прикладной уровень обеспечивает взаимодействие пользовательских приложений с сетью. Он включает множество протоколов: HTTP, FTP, SMTP, DNS, Telnet. Основные функции: предоставление сервисов для работы приложений, интерпретация запросов, поддержка удалённого доступа, обмен файлами, управление почтой и именами ресурсов. Он работает с данными в форме наиболее близкой к пользователю."
    },
    {
        "question55": "Инкапсуляции и деинкапсуляция, сегментирование, мультиплексирование в сетях",
        "answers": [
            "1. Инкапсуляция — процесс добавления заголовков и служебной информации на каждом уровне модели OSI. Деинкапсуляция — обратный процесс удаления заголовков на принимающей стороне. Сегментирование — разделение данных на фрагменты для передачи. Мультиплексирование — одновременная передача нескольких потоков данных по одному каналу с использованием портов или временного распределения.",
            "2. Инкапсуляция выполняется только маршрутизаторами при подключении к Wi-Fi. Мультиплексирование означает одновременное подключение нескольких мониторов к компьютеру.",
            "3. Сегментирование касается только жёстких дисков, а инкапсуляция — это упаковка данных в архивы ZIP перед отправкой."
        ],
        "correct_answer": "1. Инкапсуляция — процесс добавления заголовков и служебной информации на каждом уровне модели OSI. Деинкапсуляция — обратный процесс удаления заголовков на принимающей стороне. Сегментирование — разделение данных на фрагменты для передачи. Мультиплексирование — одновременная передача нескольких потоков данных по одному каналу с использованием портов или временного распределения."
    },
    {
        "question56": "Настройка сетевой платы ПК",
        "answers": [
            "1. Настройка сетевой платы включает выбор режима работы (автоопределение скорости или фиксированная), настройку дуплекса, управление энергосбережением, выбор MAC-адреса (при необходимости), настройку драйвера, MTU, параметров VLAN, приоритетов QoS. Также возможна конфигурация IPv4/IPv6, DNS, шлюза и параметров Wake-on-LAN.",
            "2. Настройка сетевой карты заключается только в установке видеодрайвера и выборе разрешения экрана. Других параметров не существует.",
            "3. Сетевая карта не требует настроек, так как она автоматически использует настройки процессора и видеокарты. Изменить её параметры невозможно."
        ],
        "correct_answer": "1. Настройка сетевой платы включает выбор режима работы (автоопределение скорости или фиксированная), настройку дуплекса, управление энергосбережением, выбор MAC-адреса (при необходимости), настройку драйвера, MTU, параметров VLAN, приоритетов QoS. Также возможна конфигурация IPv4/IPv6, DNS, шлюза и параметров Wake-on-LAN."
    },
    {
        "question57": "Виртуальные частные сети",
        "answers": [
            "1. VPN — это технология создания защищённого канала поверх публичной сети. Использует туннелирование, шифрование и аутентификацию для защиты данных. Типы VPN: PPTP, L2TP/IPsec, OpenVPN, WireGuard. Применяется для удалённого доступа, защиты трафика, обхода ограничений, объединения офисов. Обеспечивает конфиденциальность, целостность и защиту данных.",
            "2. VPN — это отдельная физическая сеть, построенная исключительно на оптоволокне. Она не использует шифрование, так как полностью изолирована от интернета.",
            "3. VPN — это функция браузера, которая ускоряет загрузку страниц за счёт кеширования данных на локальном компьютере."
        ],
        "correct_answer": "1. VPN — это технология создания защищённого канала поверх публичной сети. Использует туннелирование, шифрование и аутентификацию для защиты данных. Типы VPN: PPTP, L2TP/IPsec, OpenVPN, WireGuard. Применяется для удалённого доступа, защиты трафика, обхода ограничений, объединения офисов. Обеспечивает конфиденциальность, целостность и защиту данных."
    },
    {
        "question58": "Режимы доступа к ресурсам локальной сети, внесение изменений",
        "answers": [
            "1. В локальных сетях используются режимы: общий доступ (public share), доступ по учетным записям и доступ по группам безопасности. Настройки включают изменение разрешений (чтение, запись, изменение, полный доступ), управление списками ACL, создание общих папок, выбор уровня видимости, настройку прав доступа к принтерам и сетевым каталогам. Изменения вносятся через оснастки, серверные роли или параметры сетевых служб.",
            "2. В сетях доступ к ресурсам всегда открыт, и ограничить его невозможно. Все пользователи автоматически получают полный доступ ко всем каталогам.",
            "3. Режимы доступа определяются видеокартой. Чтобы изменить доступ, нужно изменить разрешение монитора, после чего автоматически обновятся и сетевые права."
        ],
        "correct_answer": "1. В локальных сетях используются режимы: общий доступ (public share), доступ по учетным записям и доступ по группам безопасности. Настройки включают изменение разрешений (чтение, запись, изменение, полный доступ), управление списками ACL, создание общих папок, выбор уровня видимости, настройку прав доступа к принтерам и сетевым каталогам. Изменения вносятся через оснастки, серверные роли или параметры сетевых служб."
    },
    {
        "question59": "Беспроводной доступ к сети. Стандарты и характеристики",
        "answers": [
            "1. Беспроводной доступ осуществляется на основе стандартов IEEE 802.11: a/b/g/n/ac/ax. Он использует диапазоны 2.4 и 5 ГГц, обеспечивает различные скорости, модуляции, ширину каналов. Характеристики включают дальность, чувствительность, помехоустойчивость, пропускную способность, типы безопасности (WPA2, WPA3). Беспроводные сети обеспечивают мобильность, но могут иметь повышенную задержку и подверженность интерференции.",
            "2. Беспроводной доступ всегда работает только в диапазоне 1 ГГц и имеет фиксированную скорость 100 Мбит/с. Безопасность не используется, так как сигнал считается защищённым по умолчанию.",
            "3. Стандарты беспроводной связи относятся только к мобильным телефонам, а Wi-Fi является проводной технологией, где радиосигнал служит лишь резервным каналом."
        ],
        "correct_answer": "1. Беспроводной доступ осуществляется на основе стандартов IEEE 802.11: a/b/g/n/ac/ax. Он использует диапазоны 2.4 и 5 ГГц, обеспечивает различные скорости, модуляции, ширину каналов. Характеристики включают дальность, чувствительность, помехоустойчивость, пропускную способность, типы безопасности (WPA2, WPA3). Беспроводные сети обеспечивают мобильность, но могут иметь повышенную задержку и подверженность интерференции."
    },
    {
        "question60": "Широкополосные технологии и их характеристики",
        "answers": [
            "1. Широкополосные технологии включают xDSL, DOCSIS (кабельный интернет), оптоволоконные FTTH/FTTB решения, LTE/5G. Они обеспечивают высокую пропускную способность, многоканальную передачу, поддержку симметричных и асимметричных каналов, стабильность и высокую доступность. Отличаются диапазонами частот, типами модуляции и инфраструктурой. Применяются в домашних и корпоративных сетях.",
            "2. Широкополосные технологии — это исключительно спутниковая связь, которая работает на скорости не более 1 Мбит/с. Другие технологии относятся к узкополосным.",
            "3. Широкополосные технологии включают только ADSL, так как она самая быстрая, а современные мобильные сети 5G относятся к телефонным стандартам и не имеют отношения к передаче данных."
        ],
        "correct_answer": "1. Широкополосные технологии включают xDSL, DOCSIS (кабельный интернет), оптоволоконные FTTH/FTTB решения, LTE/5G. Они обеспечивают высокую пропускную способность, многоканальную передачу, поддержку симметричных и асимметричных каналов, стабильность и высокую доступность. Отличаются диапазонами частот, типами модуляции и инфраструктурой. Применяются в домашних и корпоративных сетях."
    }
]